//------------------------------------------------------------------------------
//! @author Edited by: Ковалев А.Г.
//!
/*! @file

    @brief
			Классы описывающие вспомогательные типы для построения карты
    @details  */
//------------------------------------------------------------------------------
#ifndef HEIGHTMAP_H
#define HEIGHTMAP_H
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
#include "Geometry.h"
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//------------------------------ HeightMapPoint --------------------------------
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//! Класс HeightMapPoint представляет двумерные случайные точки с высотами
/*! */
//------------------------------------------------------------------------------
class HeightMapPoint
{
public:
	HeightMapPoint();
	HeightMapPoint( float x, float h, float y );
	HeightMapPoint( const Vector2D& vec, float h );
	HeightMapPoint( const HeightMapPoint& other );
	HeightMapPoint& operator=( const HeightMapPoint& other );

	//! Сравнивает двумерны вектора. Оператор неравно
	bool operator != ( const HeightMapPoint& other ) const;
	//! Сравнивает двумерны вектора. Оператор равно
	bool operator == ( const HeightMapPoint& other ) const;
	//! Сравнивает двумерные вектора. Оператор меньше
	bool operator < ( const HeightMapPoint& other ) const;

	Vector2D v;
	float	h;
};

//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//----------------------------------- Cell -------------------------------------
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//! Класс Cell представляет двумерные равнораспределенные точки с высотами
//! Используется в двумерном массиве для определения препятствий
//! Если препятствия не существует, то на его месте нулевой указатель
/*! */
//------------------------------------------------------------------------------
class Cell
{
public:
	Cell();
	Cell( float x, float h, float y, float step );
	Cell( const Vector2D& vec, float h, float step );
	Cell( const Cell& other );
	Cell& operator=( const Cell& other );

	//! Сравнивает двумерные вектора. Оператор неравно
	bool operator != ( const Cell& other ) const;
	//! Сравнивает двумерные вектора. Оператор равно
	bool operator == ( const Cell& other ) const;
	//! Сравнивает двумерные вектора. Оператор меньше
	bool operator < ( const Cell& other ) const;

	Vector2D v;
	float	h;
	float step;
};

#endif